app/Controllers/Addfaculty.php

    public function index()
    {
        $usermodel = new UserModel();
        $username=$this->request->getPost('fusername');
        $useremail=$this->request->getPost('fuseremail');
        $phoneno=$this->request->getPost('fphoneno');
        $password=$this->request->getPost('fpassword');
        $cpassword=$this->request->getPost('fcpassword');

        echo $username. $useremail.$phoneno.$password;
        if($password == $cpassword)
        {
            $p=1;
            $password= password_hash($password,PASSWORD_DEFAULT);
            $data=[
                'useremail'=>$useremail,
                'username'=>$username,
                'phonenumber'=>$phoneno,
                'password'=>$password,
                'profession'=>$p
            ];
        }
        // print_r($data);
        else {
            $_SESSION['passcpass'] = 'Sorry, password and confirmpassword not match';
            $session = session();
            $session->markAsFlashdata('passcpass');
           return redirect()->to('/adminpanel');
        }

        $r = $usermodel->insert($data);
---
INSERT INTO `users` (`useremail`, `username`, `password`, `profession`, `fcategory`) VALUES ('kasodiyakhushi@gmail.com', 'khushi', '$2y$10$5/Vo8SZmaDhXMFcucBxtX.x6u1e3iKBAjnyV8dHBCLN5aJMf9wzTq', 1, '10')