app/Controllers/Adminlogin.php

    public function adminlogin()
    {
     $userModel = new AdminModel();
     $email = $this->request->getPost('adminemail');
     $password = $this->request->getPost('adminpassword');


     $result = $userModel->where('admin_email',$email)->first();
---
SELECT *
FROM `admin`
WHERE `admin_email` = 'admin@admin.com'
 LIMIT 1