app/Controllers/Login.php

    public function login()
    {
     $userModel = new userModel();
     $email = $this->request->getPost('email');
     $password = $this->request->getPost('password');


     $result = $userModel->where('useremail',$email)->first();
---
SELECT *
FROM `users`
WHERE `useremail` = 'user5@user.com'
 LIMIT 1